app/views/posts/_post.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."post_id" = $1  [["post_id", 15]]
---
	<section class="footer-sumary ">
		<%= raw post.tags.map(&:name).map { |t| link_to t, tag_path(t), class: 'badge badge-primary' }.join(' ') %>