app/controllers/posts_controller.rb

	def create
		@post = Post.new(post_params)
		if @post.save
---
INSERT INTO "posts" ("title", "sumary", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Third Title"], ["sumary", "Third sumary"], ["body", "third body"], ["created_at", "2018-03-30 20:24:29.122174"], ["updated_at", "2018-03-30 20:24:29.122174"]]

def update
	if @post.update_attributes(post_params)
---
UPDATE "posts" SET "sumary" = $1, "body" = $2, "image" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["sumary", "Краткое содержание"], ["body", "<pre>ГАМНОКОООООД</pre><div><br></div>"], ["image", "fly.jpg"], ["updated_at", "2018-04-14 10:06:04.798300"], ["id", 14]]