app/controllers/tags_controller.rb

	def show
		@tag = Tag.find_by(name: params[:id])
---
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = $1 LIMIT $2  [["name", "Fuck"], ["LIMIT", 1]]